###       EXPLORATORY DATA ANALYSIS TO GENERATE INSIGHTS FOR MICROSOFT COMPANY

#### BUSINESS PROBLEM

###### Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

####  1. DATA UNDERSTANDING 

##### The following task is quite intuisive and recquiers a well analysed data of a rather different movie store. to basically determine how they perfom in the same field, how they interact- best genres, how they rate , the prices they use and how they sale within particular time frames. The analysis there for entails a well worked through csv files, sql files with relevant data to help depict the companies next step.

##### This next cell is importing of the recquired python libraries that aids in objective completion


#### Importing libraries

In [243]:

import pandas as pd
import numpy as np
import matplotlib as plt
import matplotlib.pyplot as plt

#### 1.0 Dowloading datasets

##### The cell below is coded to retrieve the data used from the storage location. 

##### Pandas makes creates a DataFrame that is explorable  rather than comma sep' values and here r converts a normal string to a raw string:

In [298]:


df1 = pd.read_csv(r"C:\Users\John Mbego\Documents\DS_PROJECTS\dsc-phase-1-project-v2-4\zippedData\tmdb.movies.csv.gz")

In [299]:
df2 = pd.read_csv(r"C:\Users\John Mbego\Documents\DS_PROJECTS\dsc-phase-1-project-v2-4\zippedData\bom.movie_gross.csv.gz")

In [300]:
df3 = pd.read_csv(r"C:\Users\John Mbego\Documents\DS_PROJECTS\dsc-phase-1-project-v2-4\zippedData\tn.movie_budgets.csv.gz")

In [322]:
df4 = pd.read_csv(r"C:\Users\John Mbego\Documents\DS_PROJECTS\dsc-phase-1-project-v2-4\zippedData\rt.movie_info.tsv.gz",sep='\t')

## Data preparation

##### 1. droping empty valued cells

In [303]:
df1.dropna()
df1.drop_duplicates()
df1.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

In [308]:
df2.dropna()
df2.drop_duplicates()
df2.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

In [309]:
df3.dropna()
df3.drop_duplicates()
df3.head(2)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"425,000,000","760,507,625","2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"410,600,000","241,063,875","1,045,663,875"

In [323]:
df4.dropna()
df4.drop_duplicates()
df4.head(2)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One

### 2. Cleaning

In [311]:
popularity_df1 = df1.drop(['Unnamed: 0','original_title','release_date',],axis=1)

In [312]:

df2["domestic_gross"] = pd.to_numeric(df2["domestic_gross"],errors='coerce')
df2["foreign_gross"] = pd.to_numeric(df2["foreign_gross"],errors='coerce')
gross_df2 = df2.drop(["studio","year"], axis=1)

In [314]:
gross_df2['total_gross']=gross_df2['domestic_gross']+gross_df2['foreign_gross']

In [318]:
df3['production_budget'] = df3['production_budget'].str.replace('$','')
df3['domestic_gross'] = df3['domestic_gross'].str.replace('$','')
df3['worldwide_gross'] = df3['worldwide_gross'].str.replace('$','')

In [319]:
budgets_df3 = df3.drop(['release_date'],axis=1)

In [321]:

genres_df4 = df4.drop(['director','dvd_date','studio','rating','writer','currency','theater_date'],axis=1)
genres_df4.head(5)

,id,synopsis,genre,box_office,runtime
0,1,"This gritty, fast-paced, and innovative police...",Action and Adventure|Classics|Drama,NaN,104 minutes
1,3,"New York City, not-too-distant-future: Eric Pa...",Drama|Science Fiction and Fantasy,"600,000",108 minutes
2,5,Illeana Douglas delivers a superb performance ...,Drama|Musical and Performing Arts,NaN,116 minutes
3,6,Michael Douglas runs afoul of a treacherous su...,Drama|Mystery and Suspense,NaN,128 minutes
4,7,NaN,Drama|Romance,NaN,200 minutes

### CONCATENATING 

##### The above cells under dowloading of the data have three imported csv files that each contain information on columns that are quite necessary for our exploration , ie df1 (data frame 1 ) has movies together with popularity but misses the gross. Concatenating the data therefore ensures a second csv file alias  df2 (data frame 2 ) and df3 with the gross is added to the new data frame alias movies_rt .
##### Instead of the merge and join function the best way rather, this analysis uses concat built in function. append is way soon getting outdated but it can on be used.

In [320]:
movies_rt=pd.concat([df1,df2,df3],axis=1)
movies_rt.head(3)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,...,studio,domestic_gross,foreign_gross,year,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,...,BV,415000000.0,652000000.0,2010.0,1.0,"Dec 18, 2009",Avatar,"425,000,000","760,507,625","2,776,345,279"
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,...,BV,334200000.0,691300000.0,2010.0,2.0,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"410,600,000","241,063,875","1,045,663,875"
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,...,WB,296000000.0,664300000.0,2010.0,3.0,"Jun 7, 2019",Dark Phoenix,"350,000,000","42,762,350","149,762,350"

#### 1.1 Description 

##### This is important part of the understanding and the visibilty helps to check and comprehend the type of data structures to work with.
##### The below cell also entails the info types of data entailed and also the column names

In [6]:

movies_rt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 21 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
 10  title              3387 non-null   object
 11  studio             3382 non-null   object
 12  domestic_gross     3359 non-null   float64
 13  foreign_gross      2037 non-null   object
 14  year               3387 non-null   float64
 15  id                 5782 non-null   float64
 16  release_date       5782 non-null   object
 17  movie              5782 non-null   object
 18  production_budget  5782 non-null   object
 19  domestic_gross     5782 non-null   object
 20  worldwide_gross    5782 non-null   object
dtypes: float64(5), int64(3), object(13)
memory usage: 4.2+ MB

In [8]:
#descibes the type of data that the analysis majors on , it shows clearly the numerics present
movies_rt.describe()

,Unnamed: 0,id,popularity,vote_average,vote_count,domestic_gross,year,id
count,26517.00000,26517.000000,26517.000000,26517.000000,26517.000000,3.359000e+03,3387.000000,5782.000000
mean,13258.00000,295050.153260,3.130912,5.991281,194.224837,2.874585e+07,2013.958075,50.372363
std,7654.94288,153661.615648,4.355229,1.852946,960.961095,6.698250e+07,2.478141,28.821076
min,0.00000,27.000000,0.600000,0.000000,1.000000,1.000000e+02,2010.000000,1.000000
25%,6629.00000,157851.000000,0.600000,5.000000,2.000000,1.200000e+05,2012.000000,25.000000
50%,13258.00000,309581.000000,1.374000,6.000000,5.000000,1.400000e+06,2014.000000,50.000000
75%,19887.00000,419542.000000,3.694000,7.000000,28.000000,2.790000e+07,2016.000000,75.000000
max,26516.00000,608444.000000,80.773000,10.000000,22186.000000,9.367000e+08,2018.000000,100.000000

### Data prepation and cleaning

In [9]:
movies_rt.dropna()
movies_rt.head(3)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,...,studio,domestic_gross,foreign_gross,year,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,...,BV,415000000.0,652000000,2010.0,1.0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,...,BV,334200000.0,691300000,2010.0,2.0,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,...,WB,296000000.0,664300000,2010.0,3.0,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"

In [47]:
movies_rt.shape

(26517, 19)

In [10]:

# movies_new_rt=movies_rt.drop(["original_language", "studio",""],axis=1)
# movies_new_rt.head()